[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:128:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
             </Nav>
