[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:46:9
             Header: 'Day',
             accessor: 'day',
         },
-        {
-            Header: 'Shift Start',
-            accessor: 'shiftStart',
-        },
+        {},
         {
             Header: 'Shift End',
killedBy: ShiftIndexPage tests fetches shifts using the correct GET method
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:51:21
             accessor: 'shiftStart',
         },
         {
-            Header: 'Shift End',
+            Header: "",
             accessor: 'shiftEnd',
         },
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift End. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:62:9
                 <Link to={`/driverInfo/${value}`}>{value}</Link>
               ),
         },
-        {
-            Header: 'Backup Driver',
-            accessor: 'driverBackupID',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
-        }
+        {}
     ];
 
killedBy: ShiftTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:63:21
               ),
         },
         {
-            Header: 'Backup Driver',
+            Header: "",
             accessor: 'driverBackupID',
             Cell: ({ value }) => (
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backup Driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
