[Killed] ArrowFunction
main/components/Ride/RideTable.js:159:19
         {
             Header: 'Assigned?',
             accessor: 'shiftId',
-            Cell: ({ value }) => (
-                value === '0' ? 'unassigned' : 'assigned'
-            ),
+            Cell: () => undefined,
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Ride/RideTable.js:160:17
             Header: 'Assigned?',
             accessor: 'shiftId',
             Cell: ({ value }) => (
-                value === '0' ? 'unassigned' : 'assigned'
+                false ? 'unassigned' : 'assigned'
             ),
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  unassigned
Received:
  assigned

[Killed] EqualityOperator
main/components/Ride/RideTable.js:160:17
             Header: 'Assigned?',
             accessor: 'shiftId',
             Cell: ({ value }) => (
-                value === '0' ? 'unassigned' : 'assigned'
+                value !== '0' ? 'unassigned' : 'assigned'
             ),
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  unassigned
Received:
  assigned

[Killed] StringLiteral
main/components/Ride/RideTable.js:185:23
         },
         {
             Header: 'Drop Off Building',
-            accessor: 'dropoffBuilding',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-dropoffBuilding"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:206:55
 
     const buttonColumnsAdmin = [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("Edit", "primary", editCallback, ""),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
         ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:206:22
 
     const buttonColumnsAdmin = [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("", "primary", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
         ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:208:39
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
-        ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
+        ButtonColumn("Assign Driver", "", assignCallback, "RideTable")
     ]
 
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Timeout] StringLiteral
main/components/Ride/RideTable.js:218:17
     return <OurTable
         data={ride}
         columns={columnsToDisplay}
-        testid={"RideTable"}
+        testid={""}
     />;
 };
