[Killed] ConditionalExpression
main/components/Ride/RideTable.js:160:17
             Header: 'Assigned?',
             accessor: 'shiftId',
             Cell: ({ value }) => (
-                value === '0' ? 'unassigned' : 'assigned'
+                true ? 'unassigned' : 'assigned'
             ),
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^assigned$/
Received:
  unassigned
