[Killed] Regex
main/components/Driver/DriverAvailabilityForm.js:108:36
                     {...register("endTime", {
                         required: "End Time is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0?[1-9]|1[0-2]):[0-5][^0-9](AM|PM)$/,
                             message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }
killedBy: DriverAvailabilityForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
