[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:9:78
 
 
 
-function RideAssignDriverForm({ initialContents, submitAction, buttonLabel = "Assign Driver" }) {
+function RideAssignDriverForm({ initialContents, submitAction, buttonLabel = "" }) {
     const navigate = useNavigate();
     
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Assign Driver/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:13:10
     const navigate = useNavigate();
     
     const { data: drivers, error: _error, status: _status } = useBackend(
-        ["/api/drivers/all"],
+        [""],
         { method: "GET", url: "/api/drivers/all" },
         []

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:14:19
     
     const { data: drivers, error: _error, status: _status } = useBackend(
         ["/api/drivers/all"],
-        { method: "GET", url: "/api/drivers/all" },
+        { method: "", url: "/api/drivers/all" },
         []
     );

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:14:31
     
     const { data: drivers, error: _error, status: _status } = useBackend(
         ["/api/drivers/all"],
-        { method: "GET", url: "/api/drivers/all" },
+        { method: "GET", url: "" },
         []
     );

[Survived] ArrayDeclaration
main/components/Ride/RideAssignDriverForm.js:19:9
     );
 
     const { data: driverAvailabilities, error: _availabilityError, status: _availabilityStatus } = useBackend(
-        ["/api/driverAvailability/admin/all"],
+        [],
         { method: "GET", url: "/api/driverAvailability/admin/all" },
         []

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:20:19
 
     const { data: driverAvailabilities, error: _availabilityError, status: _availabilityStatus } = useBackend(
         ["/api/driverAvailability/admin/all"],
-        { method: "GET", url: "/api/driverAvailability/admin/all" },
+        { method: "", url: "/api/driverAvailability/admin/all" },
         []
     );

[Survived] ArrayDeclaration
main/components/Ride/RideAssignDriverForm.js:21:9
     const { data: driverAvailabilities, error: _availabilityError, status: _availabilityStatus } = useBackend(
         ["/api/driverAvailability/admin/all"],
         { method: "GET", url: "/api/driverAvailability/admin/all" },
-        []
+        ["Stryker was here"]
     );
 

[Killed] ObjectLiteral
main/components/Ride/RideAssignDriverForm.js:25:9
     );
 
     const { register, formState: { errors }, handleSubmit } = useForm(
-        { defaultValues: initialContents }
+        {}
     );
 
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "id": 17,
+   "id": undefined,

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:28:26
         { defaultValues: initialContents }
     );
 
-    const testIdPrefix = "RideAssignDriverForm";
+    const testIdPrefix = "";
 
     // Helper func
killedBy: RideAssignDriverForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RideAssignDriverForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] BlockStatement
main/components/Ride/RideAssignDriverForm.js:31:45
     const testIdPrefix = "RideAssignDriverForm";
 
     // Helper func
-    const getDriverFullName = (driverId) => {
-        
-        const driver = drivers.find(driver => driver.id === driverId);
-        if(!driver) {
-            console.log("No driver ");
-        }
-        if(driver) {
-            console.log("There's a driver");
-        }
-        return driver ? `${driver.givenName} ${driver.familyName}` : '';
-    };
+    const getDriverFullName = (driverId) => {};
 
 

[Survived] ArrowFunction
main/components/Ride/RideAssignDriverForm.js:33:37
     // Helper func
     const getDriverFullName = (driverId) => {
         
-        const driver = drivers.find(driver => driver.id === driverId);
+        const driver = drivers.find(() => undefined);
         if(!driver) {
             console.log("No driver ");

[Survived] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:33:47
     // Helper func
     const getDriverFullName = (driverId) => {
         
-        const driver = drivers.find(driver => driver.id === driverId);
+        const driver = drivers.find(driver => true);
         if(!driver) {
             console.log("No driver ");

[Survived] BooleanLiteral
main/components/Ride/RideAssignDriverForm.js:34:12
     const getDriverFullName = (driverId) => {
         
         const driver = drivers.find(driver => driver.id === driverId);
-        if(!driver) {
+        if(driver) {
             console.log("No driver ");
         }

[Survived] BlockStatement
main/components/Ride/RideAssignDriverForm.js:34:21
     const getDriverFullName = (driverId) => {
         
         const driver = drivers.find(driver => driver.id === driverId);
-        if(!driver) {
-            console.log("No driver ");
-        }
+        if(!driver) {}
         if(driver) {
             console.log("There's a driver");

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:35:25
         
         const driver = drivers.find(driver => driver.id === driverId);
         if(!driver) {
-            console.log("No driver ");
+            console.log("");
         }
         if(driver) {

[Survived] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:37:12
         if(!driver) {
             console.log("No driver ");
         }
-        if(driver) {
+        if(false) {
             console.log("There's a driver");
         }

[Survived] BlockStatement
main/components/Ride/RideAssignDriverForm.js:37:20
         if(!driver) {
             console.log("No driver ");
         }
-        if(driver) {
-            console.log("There's a driver");
-        }
+        if(driver) {}
         return driver ? `${driver.givenName} ${driver.familyName}` : '';
     };

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:38:25
             console.log("No driver ");
         }
         if(driver) {
-            console.log("There's a driver");
+            console.log("");
         }
         return driver ? `${driver.givenName} ${driver.familyName}` : '';

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:40:70
         if(driver) {
             console.log("There's a driver");
         }
-        return driver ? `${driver.givenName} ${driver.familyName}` : '';
+        return driver ? `${driver.givenName} ${driver.familyName}` : "Stryker was here!";
     };
 

[Killed] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:48:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             
killedBy: RideAssignDriverForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RideAssignDriverForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] ObjectLiteral
main/components/Ride/RideAssignDriverForm.js:72:45
                     as="select"
                     type="select"
                     isInvalid={Boolean(errors.shiftId)}
-                    {...register("shiftId", {
-                        required: "Shift Id is required."
-                    })}
+                    {...register("shiftId", {})}
                     defaultValue={initialContents?.shiftId}
                 >

[Killed] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:77:22
                     })}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {driverAvailabilities && driverAvailabilities.map(availability => (
-                        <option key={availability.id} value={availability.id}>
-                            {`${availability.id} - ${getDriverFullName(availability.driverId)} - ${availability.day} ${availability.startTime}-${availability.endTime}`}
-                        </option>
-                    ))}
+                    {false}
                 </Form.Select>
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] ArrowFunction
main/components/Ride/RideAssignDriverForm.js:77:71
                     })}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {driverAvailabilities && driverAvailabilities.map(availability => (
-                        <option key={availability.id} value={availability.id}>
-                            {`${availability.id} - ${getDriverFullName(availability.driverId)} - ${availability.day} ${availability.startTime}-${availability.endTime}`}
-                        </option>
-                    ))}
+                    {driverAvailabilities && driverAvailabilities.map(() => undefined)}
                 </Form.Select>
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:157:34
                     id="dropoffBuilding"
                     type="text"
                     isInvalid={Boolean(errors.dropoffBuilding)}
-                    {...register("dropoffBuilding")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.dropoffBuilding}
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
