[Killed] LogicalOperator
main/components/Driver/DriverAvailabilityForm.js:32:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="driverId">Driver Id</Form.Label>
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:52:46
                     id="driverId"
                     type="text"
                     isInvalid={Boolean(errors.driverId)}
-                    {...register("driverId", {
-                        required: "Driver Id is required.",
-                    })}
+                    {...register("driverId", {})}
                     placeholder="e.g. 1"   
                     defaultValue={initialContents?.driverId}  
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Driver Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:56:35
                         required: "Driver Id is required.",
                     })}
                     placeholder="e.g. 1"   
-                    defaultValue={initialContents?.driverId}  
+                    defaultValue={initialContents.driverId}  
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'driverId')

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:96:35
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
                     {...register("startTime", {
-                        required: "Start Time is required.",
+                        required: "",
                         pattern: {
                             value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:97:34
                     isInvalid={Boolean(errors.startTime)}
                     {...register("startTime", {
                         required: "Start Time is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          }
+                        pattern: {}
                     })}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"   
killedBy: DriverAvailabilityForm tests Error messages on bad time format
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Please enter time in the format HH:MM AM/PM (e.g., 3:30PM).
Received:


<html>

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:113:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="endTime">End Time</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-endTime"}
+                    data-testid={testIdPrefix + ""}
                     id="endTime"
                     type="text"
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-endTime"]

<body>
  <div>
    <form
      class=""
    >
      <div
