[Killed] BlockStatement
main/components/Driver/DriverAvailabilityForm.js:23:42
 
     const startTime = watch("startTime");
 
-    const validateEndTime = (endTime) => {
-        if (!startTime || !endTime) return true;
-        const format = "hh:mma";
-        const start = parse(startTime, format, new Date());
-        const end = parse(endTime, format, new Date());
-        return isBefore(start, end) || "End time must be later than start time.";
-    };
+    const validateEndTime = (endTime) => {};
 
     return (
killedBy: DriverAvailabilityForm tests Error message when end time is not later than start time
statusReason: Error: Unable to find an element with the text: End time must be later than start time.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Driver/DriverAvailabilityForm.js:24:13
     const startTime = watch("startTime");
 
     const validateEndTime = (endTime) => {
-        if (!startTime || !endTime) return true;
+        if (startTime || !endTime) return true;
         const format = "hh:mma";
         const start = parse(startTime, format, new Date());
killedBy: DriverAvailabilityForm tests Error message when end time is not later than start time
statusReason: Error: Unable to find an element with the text: End time must be later than start time.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:24:13
     const startTime = watch("startTime");
 
     const validateEndTime = (endTime) => {
-        if (!startTime || !endTime) return true;
+        if (true) return true;
         const format = "hh:mma";
         const start = parse(startTime, format, new Date());
killedBy: DriverAvailabilityForm tests Error message when end time is not later than start time
statusReason: Error: Unable to find an element with the text: End time must be later than start time.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:28:16
         const format = "hh:mma";
         const start = parse(startTime, format, new Date());
         const end = parse(endTime, format, new Date());
-        return isBefore(start, end) || "End time must be later than start time.";
+        return true;
     };
 
killedBy: DriverAvailabilityForm tests Error message when end time is not later than start time
statusReason: Error: Unable to find an element with the text: End time must be later than start time.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:141:43
                     id="notes"
                     type="text"
                     isInvalid={Boolean(errors.notes)}
-                    {...register("notes", {
-                        required: "Notes is required."
-                    })}
+                    {...register("notes", {})}
                     placeholder="e.g. I am mostly available on Tuesday and Thursdays."  
                     defaultValue={initialContents?.notes}  
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Notes is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
