[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:6:80
 import { useNavigate } from 'react-router-dom';
 import { parse, isBefore } from 'date-fns';
 
-function DriverAvailabilityForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function DriverAvailabilityForm({ initialContents, submitAction, buttonLabel = "" }) {
     // Stryker disable all
     const {
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Driver/DriverAvailabilityForm.js:23:42
 
     const startTime = watch("startTime");
 
-    const validateEndTime = (endTime) => {
-        const format = "hh:mma";
-        const start = parse(startTime, format, new Date());
-        const end = parse(endTime, format, new Date());
-        return isBefore(start, end) || "End time must be later than start time.";
-    };
+    const validateEndTime = (endTime) => {};
 
     return (
killedBy: DriverAvailabilityForm tests Error message when end time is not later than start time
statusReason: Error: Unable to find an element with the text: End time must be later than start time.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:27:16
         const format = "hh:mma";
         const start = parse(startTime, format, new Date());
         const end = parse(endTime, format, new Date());
-        return isBefore(start, end) || "End time must be later than start time.";
+        return false;
     };
 
killedBy: DriverAvailabilityForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/Driver/DriverAvailabilityForm.js:27:16
         const format = "hh:mma";
         const start = parse(startTime, format, new Date());
         const end = parse(endTime, format, new Date());
-        return isBefore(start, end) || "End time must be later than start time.";
+        return isBefore(start, end) && "End time must be later than start time.";
     };
 
killedBy: DriverAvailabilityForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/Driver/DriverAvailabilityForm.js:32:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents?.driverId && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="driverId">Driver Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-driverId"}
-                        id="driverId"
-                        type="text"
-                        {...register("driverId")}
-                        value={initialContents.driverId}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents?.driverId || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="driverId">Driver Id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-driverId"} id="driverId" type="text" {...register("driverId")} value={initialContents.driverId} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'driverId')

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:32:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents?.driverId && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="driverId">Driver Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-driverId"}
-                        id="driverId"
-                        type="text"
-                        {...register("driverId")}
-                        value={initialContents.driverId}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-driverId"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:78:47
                     id="startTime"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("startTime", {
-                        required: "Start Time is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          }
-                    })}
+                    {...register("startTime", {})}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"   
                     defaultValue={initialContents?.startTime}   
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Driver/DriverAvailabilityForm.js:81:36
                     {...register("startTime", {
                         required: "Start Time is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0?[1-9]|1[0-2]):[^0-5][0-9](AM|PM)$/,
                             message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }
killedBy: DriverAvailabilityForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:86:35
                           }
                     })}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"   
-                    defaultValue={initialContents?.startTime}   
+                    defaultValue={initialContents.startTime}   
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'startTime')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:102:34
                     isInvalid={Boolean(errors.endTime)}
                     {...register("endTime", {
                         required: "End Time is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          },
+                        pattern: {},
                           validate: validateEndTime
                     })}
killedBy: DriverAvailabilityForm tests Error messages on bad time format - extra characters at beginning
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Please enter time in the format HH:MM AM/PM (e.g., 3:30PM).
Received:
  End time must be later than start time.

<html>

[Killed] Regex
main/components/Driver/DriverAvailabilityForm.js:103:36
                     {...register("endTime", {
                         required: "End Time is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)/,
                             message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           },
killedBy: DriverAvailabilityForm tests Error messages on bad time format - extra characters at end
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Please enter time in the format HH:MM AM/PM (e.g., 3:30PM).
Received:
  End time must be later than start time.

<html>

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:104:38
                         required: "End Time is required.",
                         pattern: {
                             value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter time in the format HH:MM AM/PM (e.g., 3:30PM)."
+                            message: ""
                           },
                           validate: validateEndTime
killedBy: DriverAvailabilityForm tests Error messages on bad time format - extra characters at beginning
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Please enter time in the format HH:MM AM/PM (e.g., 3:30PM).
Received:


<html>

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:109:35
                           validate: validateEndTime
                     })}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"   
-                    defaultValue={initialContents?.endTime}   
+                    defaultValue={initialContents.endTime}   
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'endTime')

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:112:22
                     defaultValue={initialContents?.endTime}   
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.endTime?.message}
+                    {errors.endTime.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:127:35
                         required: "Notes is required."
                     })}
                     placeholder="e.g. I am mostly available on Tuesday and Thursdays."  
-                    defaultValue={initialContents?.notes}  
+                    defaultValue={initialContents.notes}  
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'notes')
