[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityCreatePage.js:9:33
 
 export default function DriverAvailabilityCreatePage() {
 
-    const objectToAxiosParams = (availability) => ({
-        url: "/api/driverAvailability/new",
-        method: "POST",
-        params: {
-            driverId: availability.driverId,
-            day: availability.day,
-            startTime: availability.startTime,
-            endTime: availability.endTime,
-            notes: availability.notes
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (availability) => {
killedBy: DriverAvailabilityCreatePage tests on submit, makes request to backend, and redirects to /availability
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Drivers/DriverAvailabilityCreatePage.js:10:14
 export default function DriverAvailabilityCreatePage() {
 
     const objectToAxiosParams = (availability) => ({
-        url: "/api/driverAvailability/new",
+        url: "",
         method: "POST",
         params: {
killedBy: DriverAvailabilityCreatePage tests on submit, makes request to backend, and redirects to /availability
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Driver Availability Created - id: 5"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Drivers/DriverAvailabilityCreatePage.js:12:17
     const objectToAxiosParams = (availability) => ({
         url: "/api/driverAvailability/new",
         method: "POST",
-        params: {
-            driverId: availability.driverId,
-            day: availability.day,
-            startTime: availability.startTime,
-            endTime: availability.endTime,
-            notes: availability.notes
-        }
+        params: {}
     });
 
killedBy: DriverAvailabilityCreatePage tests on submit, makes request to backend, and redirects to /availability
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "day": "Saturday",
-   "endTime": "11:59AM",

[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityCreatePage.js:21:41
         }
     });
 
-    const onSuccess = (availability) => {
-        toast(`New Driver Availability Created - id: ${availability.id}`);
-    }
+    const onSuccess = (availability) => {}
 
     const mutation = useBackendMutation(
killedBy: DriverAvailabilityCreatePage tests on submit, makes request to backend, and redirects to /availability
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Driver Availability Created - id: 5"

Number of calls: 0
