[Killed] BooleanLiteral
main/pages/Drivers/DriverAvailabilityEditPage.js:8:65
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function DriverAvailabilityEditPage({storybook = false}) {
+export default function DriverAvailabilityEditPage({storybook = true}) {
     let { id } = useParams();
 
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/availability"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Drivers/DriverAvailabilityEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/driverAvailability/id`,
-                params: {
-                    id
-                }
+                params: {}
             }
         );
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (availability) => ({
-        url: "/api/driverAvailability",
-        method: "PUT",
-        params: {
-            id: availability.id,
-        },
-        data: {
-            driverId: availability.driverId,
-            day: availability.day,
-            startTime: availability.startTime,
-            endTime: availability.endTime,
-            notes: availability.notes
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (availability) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityEditPage.js:39:41
         }
     });
 
-    const onSuccess = (availability) => {
-        toast(`DriverAvailability Updated - id: ${availability.id}`);
-    }
+    const onSuccess = (availability) => {}
 
     const mutation = useBackendMutation(
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityEditPage.js:56:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/availability" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/availability"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Drivers/DriverAvailabilityEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability</h1>
-                {availability &&
-                <DriverAvailabilityForm initialContents={availability} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Drivers/DriverAvailabilityEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability</h1>
-                {availability &&
-                <DriverAvailabilityForm initialContents={availability} submitAction={onSubmit} buttonLabel="Update" />
+                {availability || <DriverAvailabilityForm initialContents={availability} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, driverId, day, startTime, endTime, notes}). If you meant to render a collection of children, use an array instead.
